aom
ast-grep
autoconf
automake
awscli
bash
bpytop
btop
cffi
cmake
coreutils
cryptography
cython
diffutils
doctl
docutils
dpkg
fastfetch
fd
ffmpeg
geckodriver
gettext
gh
ghostscript
git
glances
gmp
gnupg
gnutls
go
gobject-introspection
gpgme
guile
harfbuzz
highlight
htop
icu4c@78
ideviceinstaller
imagemagick
jpeg-xl
jq
lazydocker
lazygit
ldid
leptonica
libarchive
libass
libffi
libfreenect
libgpg-error
libimobiledevice
librist
libtiff
libtool
libusbmuxd
little-cms2
lua
luajit-openresty
luarocks
lzip
neovim
nghttp2
nmap
node
nss
opencode
openjdk
openjpeg
p11-kit
pango
perl
pinentry
pkgconf
pngcrush
po4a
poppler
portaudio
protobuf
pycparser
python@3.11
python@3.12
python@3.13
qt
ripgrep
smartmontools
stripe
stylua
tesseract
tmux
tree
unbound
uv
webp
wget
wxwidgets
xz
yarn
